{
    "pagetitle": "SmartBuild : A Real Time Complex Event Processing and Analytics for Smart Building Project",
    "topic": "Real Time Complex Event Processing and Analytics for Smart Buildings",
    "description": "<p>Smart buildings equipped with sensors and electronic devices as a cyber-physical system(CPS) offer a great research perspective to explore communication, computation and controlling of physical devices by using real-time Complex Event Processing (CEP) and analytics. Since CPS like Smart-Building involves the integration of several types of equipment interoperability, maintainability, signaling, bandwidth, reliability, security, privacy, authentication, data storage, heterogeneity, and cost-effectiveness are critical issues to be addressed In addition, interactivity and dynamic feedback, context correlation with respect to streaming events and uncertainties in event composition are also identified as major challenging issues. To handle all these challenges integration of smart buildings with CEP and real-time data analytics are emerging as a new area of research. <br><br>In the present research, a model for real-time CEP and analytics have been proposed for Smart-Building. The project is divided into multiple phases. It includes background study, data collections, recognizing simple and complex events, stream processing, automated construction of event definitions using machine learning, event-based real-time decision-making and performance tests. The study includes the deployment of various sensors and actuators for gathering smart building data Raspberry Pi board is used to collect data from sensors and communicate the collected data to the cloud for data analytics. Efficient real-time data computation is required to identify simple and complex events that occur while controlling different electronic devices and appliances.<p>",
    "objective": ["<p>Aim of this research is to develop a Smart Building prototype in the real-time operational environment by applying Complex Event Processing and Analytics to perform data aggregation, correlation, learning and temporal analysis for following optimized building operations:</p><br>",
        "Intelligent security system for Smart Building",
        "<ul>",
        "<li>Video surveillance system</li>",
        "<li>Access control system</li>",
        "<li>Emergency management system</li>",
        "<li>Visitor management system</li>",
        "<li>Occupancy detection system</li>",
        "</ul><br>",
        "Intelligent energy management for Smart Building",
        "<ul>",
        "<li>Energy Management Platform</li>",
        "<li>HVAC control system</li>",
        "<li>Lighting control system</li>",
        "</ul><br>",
        "Intelligent Infrastructure Management for Smart Building",
        "<ul>",
        "<li>Elevators management system</li>",
        "<li>Automatic door opening and closing system</li>",
        "<li>Motion detection system</li>",
        "</ul><br>",
        "Intelligent Environment Monitoring System for Smart Building",
        "<ul>",
        "<li>Temperature and Humidity measurement</li>",
        "<li>Air quality monitoring system</li>",
        "</ul><br>",
        "Intelligent network and communication management systems",
        "<ul>",
        "<li>Web-based interface/dashboard for Smart Building</li>",
        "<li>Mobile-based application interface for Smart Building</li>",
        "<li>Automatic Notification and Alarms</li>",
        "<li>Remote control</li>",
        "</ul>"
    ]
}